HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/sphereInReversedVortexFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         3.0;

writeControl    adjustableRunTime;

writeInterval   0.1;

deltaT          0.0025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1e10;
maxAlphaCo      0.5;

maxDeltaT       0.2;

functions
{
    setVelocity
    {
        type            setFlow;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        mode            vortex3D;
        scale           sine;
        scaleCoeffs
        {
            amplitude       1;
            frequency       0.16666;// = 1/6
            t0             -1.5;    // want cos -> time shift = -(pi/2)/(2 pi f)
            scale           1;
            level           0;
        }
        origin          (0 0 0);
        refDir          (1 0 0);
        axis            (0 1 0);
    }
}


// ************************************************************************* //
